tests/phpunit/dummy-data/subscription_signup_response_success.json

{
  "id": "pi_123abc",
  "object": "payment_intent",
  "amount": 5000,
  "amount_capturable": 0,
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
			{
				"id": "ch_abc"
			}
    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_123abc"
  },
  "client_secret": "pi_123abc_secret_UaNshLU9SSaLJLtVD6W1V7ndF",
  "confirmation_method": "automatic",
  "created": 1566581456,
  "currency": "eur",
  "customer": "cus_EgskS2dN4FzgmE",
  "description": "Playground - Order 1803",
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {
    "customer_name": "John Smith",
    "customer_email": "example3@example.com",
    "order_id": "1803",
    "payment_type": "recurring",
    "site_url": "https://localhost/"
  },
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_options": {
    "card": {
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "receipt_email": null,
  "review": null,
  "setup_future_usage": "off_session",
  "shipping": null,
  "source": "src_1EvP9PIDdSUSdcIrdTMMVT8t",
  "statement_descriptor": "This is a statement descriptor.",
  "statement_descriptor_suffix": null,
  "status": "requires_confirmation",
  "transfer_data": null,
  "transfer_group": null
}